# CurveLoopIterator Properties

---
The CurveLoopIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Gets the item at the current position of the iterator.
| CurrentObject|
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CurveLoopIterator Class
Autodesk.Revit.DB Namespace